---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfShadeDepth(System.Double)
source: html/0533ab49-9519-10d2-ab53-103dde34a7fc.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfShadeDepth Method

Checks that the shade depth is greater than or equal to zero.

## Syntax (C#)
```csharp
public static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
```

## Parameters
- **shadeDepth** (`System.Double`) - The shade depth to be checked.

## Returns
True if the shade depth is greater than or equal to zero, false otherwise.